{
  "locations": [
    {
      "id": "merion-friends",
      "name": "Merion Friends Meeting House",
      "lat": 40.0089,
      "lng": -75.2512,
      "neighborhood": "Merion Station",
      "category": "historical",
      "description": "Built in 1695, this is among the oldest continuously used places of worship in the United States.",
      "history": "Established by Welsh Quakers, this meeting house represents the religious heritage of Lower Merion's earliest settlers. The stone building has been in continuous use for over 325 years, serving as both a place of worship and community gathering space.",
      "era": "1695",
      "significance": "National Historic Landmark"
    },
    {
      "id": "general-wayne",
      "name": "General Wayne Inn Site",
      "lat": 40.0256,
      "lng": -75.2891,
      "neighborhood": "Merion",
      "category": "historical",
      "description": "Historic site where George Washington and his army stayed during the Revolutionary War.",
      "history": "One of Pennsylvania's oldest taverns, serving as a gathering place since the 1700s. The inn played a crucial role during the Revolutionary War as a strategic stop for troops and supplies.",
      "era": "1704",
      "significance": "Revolutionary War Landmark"
    },
    {
      "id": "harriton-house",
      "name": "Harriton House",
      "lat": 40.0167,
      "lng": -75.3036,
      "neighborhood": "Bryn Mawr",
      "category": "historical",
      "description": "1704 Quaker homestead; home of Charles Thomson, secretary of the Continental Congress.",
      "history": "Restored 18th-century farmhouse representing colonial-era settlement in Lower Merion. Charles Thomson lived here while serving as Secretary of the Continental Congress through the entire Revolutionary period.",
      "era": "1704",
      "significance": "Colonial Homestead"
    },
    {
      "id": "suburban-square",
      "name": "Suburban Square",
      "lat": 40.0077,
      "lng": -75.2890,
      "neighborhood": "Ardmore",
      "category": "shopping",
      "description": "One of America's first planned shopping centers (1928), featuring over 60 retail and dining establishments.",
      "history": "Developed in 1928, it set the standard for suburban shopping experiences with Strawbridge & Clothier opening the first suburban department store branch in 1930. It revolutionized retail architecture and community shopping.",
      "era": "1928",
      "significance": "National Retail Innovation"
    },
    {
      "id": "bryn-mawr-college",
      "name": "Bryn Mawr College",
      "lat": 40.0244,
      "lng": -75.3159,
      "neighborhood": "Bryn Mawr",
      "category": "education",
      "description": "Prestigious liberal arts college for women founded in 1885, known for academic excellence and beautiful campus architecture.",
      "history": "Founded by Quaker physician Dr. Joseph Wright Taylor, it was one of the first institutions of higher education for women to offer graduate degrees. The campus features notable Collegiate Gothic architecture.",
      "era": "1885",
      "significance": "Seven Sisters College"
    },
    {
      "id": "cynwyd-heritage-trail",
      "name": "Cynwyd Heritage Trail",
      "lat": 40.0109,
      "lng": -75.2357,
      "neighborhood": "Bala Cynwyd",
      "category": "parks",
      "description": "Multi-use rail-trail connecting Bala Cynwyd to the Manayunk Bridge with skyline views.",
      "history": "Repurposed former rail corridor into a linear park, popular for walking, biking, and connecting neighborhoods. The trail represents innovative urban reclamation of industrial infrastructure.",
      "era": "2010",
      "significance": "Urban Greenway"
    },
    {
      "id": "merion-cricket-club",
      "name": "Merion Cricket Club",
      "lat": 40.0089,
      "lng": -75.3205,
      "neighborhood": "Haverford",
      "category": "sports",
      "description": "Historic social and sports club founded in 1865, known for cricket, tennis and squash.",
      "history": "National Historic Landmark representing the sporting and social traditions of the Main Line. The club has hosted numerous national tournaments and maintains traditional sporting values.",
      "era": "1865",
      "significance": "National Historic Landmark"
    },
    {
      "id": "lankenau-medical",
      "name": "Lankenau Medical Center",
      "lat": 39.9890,
      "lng": -75.2580,
      "neighborhood": "Wynnewood",
      "category": "community",
      "description": "Leading medical center with a long history of serving the Main Line community.",
      "history": "Founded in 1860 as the German Hospital of Philadelphia, evolved into a major medical center known for innovation and community care. It has been at the forefront of medical advancements for over 160 years.",
      "era": "1860",
      "significance": "Regional Medical Center"
    },
    {
      "id": "haverford-college",
      "name": "Haverford College Arboretum",
      "lat": 40.0106,
      "lng": -75.3039,
      "neighborhood": "Haverford",
      "category": "education",
      "description": "200-acre arboretum with nature trail established in 1933, popular for walking and recreation.",
      "history": "Founded 1833, the campus features a 2.2 mile nature trail that follows much of the 216-acre campus perimeter. The arboretum contains over 400 species of trees and shrubs.",
      "era": "1833",
      "significance": "Campus Arboretum"
    },
    {
      "id": "ardmore-music-hall",
      "name": "Ardmore Music Hall",
      "lat": 40.0087,
      "lng": -75.2919,
      "neighborhood": "Ardmore",
      "category": "entertainment",
      "description": "Intimate concert venue hosting national and local acts in a historic setting.",
      "history": "Originally opened as the 23 East Cabaret in the 1980s, this venue has been a cornerstone of Ardmore's downtown revitalization and has hosted countless musical acts across genres.",
      "era": "1980s",
      "significance": "Live Music Venue"
    },
    {
      "id": "bryn-mawr-film",
      "name": "Bryn Mawr Film Institute",
      "lat": 40.0209,
      "lng": -75.3154,
      "neighborhood": "Bryn Mawr",
      "category": "entertainment",
      "description": "Restored 1926 Art Deco theater showing independent, classic, and first-run films.",
      "history": "Built in 1926 as the Seville Theatre, saved from demolition and restored through community efforts to serve as a nonprofit community cinema. It continues the tradition of cinematic arts on the Main Line.",
      "era": "1926",
      "significance": "Historic Cinema"
    },
    {
      "id": "rolling-hill-park",
      "name": "Rolling Hill Park",
      "lat": 40.0370,
      "lng": -75.2712,
      "neighborhood": "Gladwyne",
      "category": "parks",
      "description": "100+ acre park with old farm ruins, dog-friendly areas, and scenic hiking trails.",
      "history": "Preserves natural areas and historic mill sites while providing recreational opportunities. The park contains ruins of 19th-century mills that were central to Lower Merion's early industry.",
      "era": "19th Century",
      "significance": "Natural Preservation"
    },
    {
      "id": "west-laurel-hill",
      "name": "West Laurel Hill Cemetery",
      "lat": 40.0180,
      "lng": -75.2400,
      "neighborhood": "Bala Cynwyd",
      "category": "historical",
      "description": "1869 garden cemetery with arboretum; famous Philadelphians buried there.",
      "history": "Historic garden cemetery established in 1869 with notable architecture and landscaping. It represents the rural cemetery movement and contains the graves of many notable Philadelphians.",
      "era": "1869",
      "significance": "Garden Cemetery"
    },
    {
      "id": "st-christophers",
      "name": "St. Christopher's Church",
      "lat": 40.0380,
      "lng": -75.2780,
      "neighborhood": "Gladwyne",
      "category": "community",
      "description": "Historic church with significant architectural and community importance.",
      "history": "Established to serve the spiritual needs of the Gladwyne community. The church has been a center of community life and religious practice for generations of local families.",
      "era": "20th Century",
      "significance": "Community Church"
    },
    {
      "id": "tired-hands",
      "name": "Tired Hands Fermentaria",
      "lat": 40.0059,
      "lng": -75.2990,
      "neighborhood": "Ardmore",
      "category": "food_drink",
      "description": "Popular brewery and restaurant with creative beers and communal seating.",
      "history": "Award-winning craft brewery that has become a community gathering spot. Known for innovative brewing techniques and fostering local culinary arts.",
      "era": "2010s",
      "significance": "Craft Brewery"
    },
    {
      "id": "riverbend-environmental",
      "name": "Riverbend Environmental Education Center",
      "lat": 40.0397,
      "lng": -75.2730,
      "neighborhood": "Gladwyne",
      "category": "nature_center",
      "description": "Nature preserve and education center with trails and environmental programs.",
      "history": "Environmental education center along the Schuylkill River with trails and programs focused on conservation and environmental stewardship for all ages.",
      "era": "1974",
      "significance": "Environmental Education"
    },
    {
      "id": "appleford-arboretum",
      "name": "Appleford Arboretum",
      "lat": 40.0200,
      "lng": -75.2900,
      "neighborhood": "Villanova",
      "category": "parks",
      "description": "24-acre historic estate with formal gardens, woods, and ponds.",
      "history": "Colonial-era farm estate dating to 1728, now maintained as public gardens. The property showcases centuries of landscape architecture and horticultural practice.",
      "era": "1728",
      "significance": "Historic Estate Gardens"
    },
    {
      "id": "woodmont-estate",
      "name": "Woodmont Estate",
      "lat": 40.0400,
      "lng": -75.2900,
      "neighborhood": "Gladwyne",
      "category": "historical",
      "description": "Historic property and mansion representing Main Line estate heritage.",
      "history": "Grand estate showcasing the architectural and social history of the Main Line. The property represents the Gilded Age wealth and architectural ambition of Philadelphia's industrial elite.",
      "era": "1890s",
      "significance": "Gilded Age Estate"
    },
    {
      "id": "rosemont-college",
      "name": "Rosemont College",
      "lat": 40.0280,
      "lng": -75.3300,
      "neighborhood": "Rosemont",
      "category": "education",
      "description": "Historic campus founded in 1921 with beautiful 56-acre grounds.",
      "history": "Catholic college established in 1921, known for its scenic campus and commitment to women's education before becoming coeducational in the 21st century.",
      "era": "1921",
      "significance": "Catholic College"
    },
    {
      "id": "philadelphia-skating",
      "name": "Philadelphia Skating Club",
      "lat": 40.0046,
      "lng": -75.2972,
      "neighborhood": "Ardmore",
      "category": "sports",
      "description": "Historic figure-skating club offering public ice sessions and training.",
      "history": "One of the oldest skating clubs in the United States, founded in 1849. It has trained numerous competitive skaters and maintains Olympic-quality facilities.",
      "era": "1849",
      "significance": "Historic Skating Club"
    }
  ]
}